poiselle_exam/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2112                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          80;
        startFace       50800;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  outlet;
    }
    outlet
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          80;
        startFace       50880;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  inlet;
    }
    fixedWalls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          640;
        startFace       50960;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          51200;
        startFace       51600;
    }
)

// ************************************************************************* //
